Revit 2027 API
ParameterTypeId.StairsSupporttypeStructuralDepthOnLanding Property
 "Structural Depth On Landing": Structural Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupporttypeStructuralDepthOnLanding { get; }
Public Shared ReadOnly Property StairsSupporttypeStructuralDepthOnLanding As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupporttypeStructuralDepthOnLanding {
	ForgeTypeId^ get ();
}
static member StairsSupporttypeStructuralDepthOnLanding : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace